Reports/Затраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>Затраты</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/Затраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>Затраты</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/Затраты/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета по метаданным регистра накопления
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	УниверсальныйОтчет.ИмяРегистра = "";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Истина;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	// При написании текста запроса рекомендуется следовать правилам, описанным в следующем шаблоне текста запроса:
	//
	//ВЫБРАТЬ
	//	<ПсевдонимТаблицы.Поле> КАК <ПсевдонимПоля>,
	//	ПРЕДСТАВЛЕНИЕ(<ПсевдонимТаблицы>.<Поле>),
	//	<ПсевдонимТаблицы.Показатель> КАК <ПсевдонимПоказателя>
	//	//ПОЛЯ_СВОЙСТВА
	//	//ПОЛЯ_КАТЕГОРИИ
	//{ВЫБРАТЬ
	//	<ПсевдонимПоля>.*,
	//	<ПсевдонимПоказателя>,
	//	Регистратор,
	//	Период,
	//	ПериодДень,
	//	ПериодНеделя,
	//	ПериодДекада,
	//	ПериодМесяц,
	//	ПериодКвартал,
	//	ПериодПолугодие,
	//	ПериодГод
	//	//ПОЛЯ_СВОЙСТВА
	//	//ПОЛЯ_КАТЕГОРИИ
	//}
	//ИЗ
	//	<Таблица> КАК <ПсевдонимТаблицы>
	//	//СОЕДИНЕНИЯ
	//{ГДЕ
	//	<ПсевдонимТаблицы.Поле>.* КАК <ПсевдонимПоля>,
	//	<ПсевдонимТаблицы.Показатель> КАК <ПсевдонимПоказателя>,
	//	<ПсевдонимТаблицы>.Регистратор КАК Регистратор,
	//	<ПсевдонимТаблицы>.Период КАК Период,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, ДЕНЬ) КАК ПериодДень,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, ДЕКАДА) КАК ПериодДекада,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, МЕСЯЦ) КАК ПериодМесяц,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, КВАРТАЛ) КАК ПериодКвартал,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	//	НАЧАЛОПЕРИОДА(<ПсевдонимТаблицы>.Период, ГОД) КАК ПериодГод
	//	//ПОЛЯ_СВОЙСТВА
	//	//ПОЛЯ_КАТЕГОРИИ
	//}
	//{УПОРЯДОЧИТЬ ПО
	//	<ПсевдонимПоля>.*,
	//	<ПсевдонимПоказателя>,
	//	Регистратор,
	//	Период,
	//	ПериодДень,
	//	ПериодНеделя,
	//	ПериодДекада,
	//	ПериодМесяц,
	//	ПериодКвартал,
	//	ПериодПолугодие,
	//	ПериодГод
	//	//УПОРЯДОЧИТЬ_СВОЙСТВА
	//	//УПОРЯДОЧИТЬ_КАТЕГОРИИ
	//}
	//ИТОГИ
	//	АГРЕГАТНАЯ_ФУНКЦИЯ(<ПсевдонимПоказателя>)
	//	//ИТОГИ_СВОЙСТВА
	//	//ИТОГИ_КАТЕГОРИИ
	//ПО
	//	ОБЩИЕ
	//{ИТОГИ ПО
	//	<ПсевдонимПоля>.*,
	//	Регистратор,
	//	Период,
	//	ПериодДень,
	//	ПериодНеделя,
	//	ПериодДекада,
	//	ПериодМесяц,
	//	ПериодКвартал,
	//	ПериодПолугодие,
	//	ПериодГод
	//	//ПОЛЯ_СВОЙСТВА
	//	//ПОЛЯ_КАТЕГОРИИ
	//}
	//АВТОУПОРЯДОЧИВАНИЕ
	
	
    ТекстЗапроса = 
    "ВЫБРАТЬ
    |	Затраты.Подразделение КАК Подразделение,
    |	Затраты.СтатьяЗатрат КАК СтатьяЗатрат,
    |	Затраты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
    |	Затраты.Заказ КАК Заказ,
	|	Затраты.Период КАК Период,
	|	Затраты.Регистратор КАК Регистратор,
    |	Затраты.СуммаНачальныйОстаток КАК НачОст,
    |	Затраты.НДСНачальныйОстаток КАК НачОстНДС,
    |	Затраты.СуммаПриход КАК Приход,
    |	Затраты.НДСПриход КАК ПриходНДС,
    |	Затраты.СуммаРасход КАК Расход,
    |	Затраты.НДСРасход КАК РасходНДС,
    |	Затраты.СуммаКонечныйОстаток КАК КонОст,
    |	Затраты.НДСКонечныйОстаток КАК КонОстНДС
    |{ВЫБРАТЬ
    |	Подразделение.*,
    |	НоменклатурнаяГруппа.*,
    |	СтатьяЗатрат.*,
    |	Период,
    |	Регистратор.*,
    |	НачОст,
    |	НачОстНДС,
    |	Приход,
    |	ПриходНДС,
    |	Расход,
    |	РасходНДС,
    |	КонОст,
    |	КонОстНДС}
    |ИЗ
	|(ВЫБРАТЬ 
    |	ЗатратыОстаткиИОбороты.Подразделение КАК Подразделение,
    |	ЗатратыОстаткиИОбороты.СтатьяЗатрат КАК СтатьяЗатрат,
    |	ЗатратыОстаткиИОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
    |	ЗатратыОстаткиИОбороты.Заказ КАК Заказ,
	|	ЗатратыОстаткиИОбороты.Период КАК Период,
	|	ЗатратыОстаткиИОбороты.Регистратор КАК Регистратор,
    |	ЗатратыОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
    |	ЗатратыОстаткиИОбороты.НДСНачальныйОстаток КАК НДСНачальныйОстаток,
    |	ЗатратыОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
    |	ЗатратыОстаткиИОбороты.НДСПриход КАК НДСПриход,
    |	ЗатратыОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
    |	ЗатратыОстаткиИОбороты.НДСРасход КАК НДСРасход,
    |	ЗатратыОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
    |	ЗатратыОстаткиИОбороты.НДСКонечныйОстаток КАК НДСКонечныйОстаток
	| ИЗ
    |	РегистрНакопления.Затраты.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Регистратор {&Периодичность}, , 
    |    {Подразделение.* КАК Подразделение, 
	|		НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа, 
	|		Заказ.* КАК Заказ, 
	|		СтатьяЗатрат.* КАК СтатьяЗатрат}) КАК ЗатратыОстаткиИОбороты
	| ) КАК Затраты
	|{ГДЕ
	|	Затраты.Подразделение.*,
	|	Затраты.НоменклатурнаяГруппа.*,
	|	Затраты.Заказ.*,
	|	Затраты.СтатьяЗатрат.*,
	|	Затраты.Регистратор.*,
	|	Затраты.Период,
    |	Затраты.СуммаНачальныйОстаток КАК НачОст,
    |	Затраты.НДСНачальныйОстаток КАК НачОстНДС,
    |	Затраты.СуммаПриход КАК Приход,
    |	Затраты.НДСПриход КАК ПриходНДС,
    |	Затраты.СуммаРасход КАК Расход,
    |	Затраты.НДСРасход КАК РасходНДС,
    |	Затраты.СуммаКонечныйОстаток КАК КонОст,
    |	Затраты.НДСКонечныйОстаток КАК КонОстНДС}
	|
	|{УПОРЯДОЧИТЬ ПО
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	Заказ.*,
	|	СтатьяЗатрат.*,
	|	Период,
	|	Регистратор.*}
	|
	|ИТОГИ
	|	СУММА(НачОст),
	|	СУММА(НачОстНДС),
	|	СУММА(Приход),
	|	СУММА(ПриходНДС),
	|	СУММА(Расход),
	|	СУММА(РасходНДС),
	|	СУММА(КонОст),
	|	СУММА(КонОстНДС)
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	Заказ.*,
	|	СтатьяЗатрат.*,
	|	Период,
	|	Регистратор.*}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля( "ИсточникДанных.НоменклатурнаяГруппа" ,   "НоменклатурнаяГруппа",   НСтр("ru='Номенклатурная группа';uk='Номенклатурна група'"),   ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_НоменклатурныеГруппы);

		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение", "Подразделение");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НоменклатурнаяГруппа", НСтр("ru='Номенклатурная группа';uk='Номенклатурна група'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтатьяЗатрат", НСтр("ru='Статья затрат';uk='Стаття витрат'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НачОст", НСтр("ru='Нач. остаток';uk='Поч. залишок'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НачОстНДС"   , НСтр("ru='Нач. остаток НДС';uk='Поч. залишок ПДВ'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Приход", "Приход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ПриходНДС"   , НСтр("ru='Приход НДС';uk='Прибуток ПДВ'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Расход", "Расход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("РасходНДС"   , НСтр("ru='Расход НДС';uk='Витрата ПДВ'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КонОст", НСтр("ru='Кон. остаток)';uk='Кін. залишок)'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КонОстНДС"   , НСтр("ru='Кон. остаток НДС';uk='Кін. залишок ПДВ'"));
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	ВалютаУпр = глЗначениеПеременной("ВалютаУправленческогоУчета");
	
	УниверсальныйОтчет.ДобавитьПоказатель("НачОст", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "НачальныйОстаток", НСтр("ru='Начальный остаток (';uk='Початковий залишок ('") + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("НачОстНДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "НачальныйОстаток");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Приход", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "Приход", НСтр("ru='Приход (';uk='Прибуток ('") + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("ПриходНДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "Приход");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Расход", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "Расход", НСтр("ru='Расход (';uk='Витрата ('") + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("РасходНДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "Расход");
	
	УниверсальныйОтчет.ДобавитьПоказатель("КонОст", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "КонечныйОстаток", НСтр("ru='Конечный остаток (';uk='Кінцевий залишок ('") + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("КонОстНДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "КонечныйОстаток");
	
	
	// Добавление предопредедленных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Подразделение");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("СтатьяЗатрат");
	
	// Добавление предопредедленных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопредедленных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("СтатьяЗатрат");
	УниверсальныйОтчет.ДобавитьОтбор("НоменклатурнаяГруппа");
	УниверсальныйОтчет.ДобавитьОтбор("Заказ");
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
